package army.vin.next;

import java.util.Arrays;
import java.util.List;
import java.util.stream.Collectors;

public class Test {
    public static void main(String[] args) {
        List<String> collect1 = Arrays.asList(internal.split("\n")).stream().collect(Collectors.toList());
        List<String> collect2 = Arrays.asList(internal.split("\n"))
                .stream()
                .map(e -> e.replace("-", ""))
                .collect(Collectors.toList());
        for (int i = 0; i < collect1.size(); i++) {
            if(collect2.contains(collect1.get(i))){
                System.out.println(collect1.get(i));
            }
        }
        System.out.println(collect1.size() + " " + collect2.size());
    }

    public static final String internal = "1921И7\n" +
            "1922И7\n" +
            "1923И7\n" +
            "1924И7\n" +
            "1970И7\n" +
            "1966И7\n" +
            "1967И7\n" +
            "1925И7\n" +
            "1926И7\n" +
            "1927И7\n" +
            "1928И7\n" +
            "1929И7\n" +
            "1930И7\n" +
            "1931И7\n" +
            "1932И7\n" +
            "1933И7\n" +
            "1934И7\n" +
            "1935И7\n" +
            "1936И7\n" +
            "1937И7\n" +
            "1938И7\n" +
            "1939И7\n" +
            "1940И7\n" +
            "1941И7\n" +
            "1942И7\n" +
            "1943И7\n" +
            "1944И7\n" +
            "9300Ж1\n" +
            "1945И7\n" +
            "1946И7\n" +
            "1947И7\n" +
            "1948И7\n" +
            "1949И7\n" +
            "1950И7\n" +
            "1951И7\n" +
            "1952И7\n" +
            "1953И7\n" +
            "1954И7\n" +
            "1955И7\n" +
            "9299Ж1\n" +
            "1956И7\n" +
            "1957И7\n" +
            "1958И7\n" +
            "1959И7\n" +
            "1960И7\n" +
            "1961И7\n" +
            "1962И7\n" +
            "1963И7\n" +
            "1964И7\n" +
            "1965И7\n" +
            "1968И7\n" +
            "1969И7\n" +
            "1971И7\n" +
            "1972И7\n" +
            "1973И7\n" +
            "1974И7\n" +
            "1975И7\n" +
            "1976И7\n" +
            "1977И7\n" +
            "1978И7\n" +
            "1979И7\n" +
            "1980И7\n" +
            "2081И7\n" +
            "2082И7\n" +
            "2022И7\n" +
            "2716С9\n" +
            "1981И7\n" +
            "1982И7\n" +
            "1983И7\n" +
            "1984И7\n" +
            "1992И7\n" +
            "2704С9\n" +
            "1988И7\n" +
            "1996И7\n" +
            "1997И7\n" +
            "0023И2\n" +
            "6131H9\n" +
            "6125Н9\n" +
            "6126Н9\n" +
            "9535Е9\n";
    public static final String external = "19-28И7\n" +
            "19-31И7\n" +
            "19-39И7\n" +
            "19-47И7\n" +
            "19-51И7\n" +
            "19-42И7\n" +
            "19-29И7\n" +
            "19-53И7\n" +
            "19-82И7\n" +
            "19-64И7\n" +
            "0023И2\n" +
            "2704С9\n" +
            "19-23И7\n" +
            "19-43И7\n" +
            "19-60И7\n" +
            "19-77И7\n" +
            "19-76И7\n" +
            "2081И7\n" +
            "19-50И7\n" +
            "19-68И7\n" +
            "19-83И7\n" +
            "19-32И7\n" +
            "9536Е9\n" +
            "19-49И7\n" +
            "19-54И7\n" +
            "19-72И7\n" +
            "19-48И7\n" +
            "19-24И7\n" +
            "19-33И7\n" +
            "19-35И7\n" +
            "19-36И7\n" +
            "19-44И7\n" +
            "19-58И7\n" +
            "19-75И7\n" +
            "19-46И7\n" +
            "19-80И7\n" +
            "19-74И7\n" +
            "1979И7\n" +
            "19-61И7\n" +
            "19-25И7\n" +
            "1921И7\n" +
            "19-22И7\n" +
            "19-70И7\n" +
            "19-63И7\n" +
            "92-99Ж7\n" +
            "19-56И7\n" +
            "19-98И7\n" +
            "19-65И7\n" +
            "19-67И7.\n" +
            "19-69И7\n" +
            "2082И7\n" +
            "19-27И7\n" +
            "2554С9\n" +
            "19-40И7\n" +
            "2716С9\n" +
            "1997И7\n" +
            "19-73И7\n" +
            "19-66И7\n" +
            "19-34И7\n" +
            "19-71И7\n" +
            "19-37И7\n" +
            "19-62И7\n" +
            "19-44И7\n" +
            "19-38И7\n" +
            "1981И7\n" +
            "1992И7\n" +
            "19-52И7\n" +
            "19-41И7\n" +
            "19-78И7\n" +
            "19-26И7\n" +
            "19-45И7\n" +
            "19-55И7\n" +
            "19-57И7\n" +
            "19-59И7\n" +
            "1984И7\n";
}
