package army.vin.next;

public class VinAndSum {
    public final static String vin = "OPEL FRONTERA                        W0L06BG761V501341\n" +
            "MERSEDES-BENZ SPRINTER 310D    WDB9034621P935948\n" +
            "Газ-66                                        ХТН006615Н0516084\n" +
            "RENAULT DUSTER універсал-В VF1HJD40664630378\n" +
            "VOLKSWAGEN T4 вантажнопасажирський-В WV1ZZZ70ZXH092412\n" +
            "БАЗ А079.31Ш   Автобус-D Y7FAS931D0011381\n" +
            "ATAMAN D093/D093S2 Y7BD093S2MB000068\n" +
            "МАЗ-555102-223 САМОСКИД-С  Y3M55510280012747\n" +
            "ГАЗ-330232-414 вантажний загальний X9633023080633672\n" +
            "ГАЗ-66  №0484332\n" +
            "УАЗ-396294ШД мікроавто меддопом.-D XTT37419480448487\n" +
            "УАЗ-3303                                                                      Б/Н\n" +
            "ГАЗ-6611 фургон-С                               ХТН00661N0701582\n" +
            "ГАЗ-66                                                                263153\n" +
            "ЗИЛ-131 АЦ40                                                    625662\n" +
            "ЗИЛ-131 БОРТОВИЙ-С                                    137143\n" +
            "ГАЗ-66 Фургон-С                                               №.0049289\n" +
            "МАЗ-54322 Бортовий-С                              №19835\n" +
            "ЗИЛ-130 Бортовий-С                                                        № 443353/3200\n" +
            "КАМАЗ-5410 сідловий тягач-Е                                      ХТС541000Р2047413\n" +
            "ОДАЗ 9370 Н/ПРИЧІП-ПЛАТФОРМА-Е                                  129101\n" +
            "КрАЗ-65055 Самоскид-С    Y7A65055080808355\n" +
            "БАЗ А079.23 АВТОБУС-D    38122585L72796\n" +
            "ЛАЗ-695НГ Автобус          XTW695000M0155215\n" +
            "MAN-11.230 Загальний автобус   WMA4691758G095134\n" +
            "БАЗ А079.14З АВТОБУС-D  Y7FA0791460002803\n" +
            "Mersedes-benz 814D            WDB6740121K092392\n" +
            "TOYOTA LAND CRUISER PRADO 150    JTEBX3FJ40K322520\n" +
            "Mersedes-benz sprinter 308 CDI фург.малот-В  WDB9036121R537465\n" +
            "Volkswagen Transporter WV1ZZZ70ZWH045156 \n" +
            "Mercedes-benz sprinter 311CDI автобус-D    WDB9036631R596040\n" +
            "Mercedes-benz sprinter вантажн.фургон.   WBB9036121R396983\n" +
            "RENAULT MASTER спец.вантаж. Фургон   VF1MAFECC52909429\n" +
            "FORD TRANSIT                                WF0LXXGBVLXJ18199\n" +
            "СITROEN BERLINGO Фургон     VF77H9HKCDJ615483\n" +
            "FIAT DUCATO                                  ZFA23000005585882\n" +
            "OPEL FRONTERA            W0L06BG761V603467\n" +
            "FORD TRANSIT                 WF0UXXTTPUAB27678\n" +
            "CITROEN JUMPY                VF7BYRHXA12712808              \n" +
            "ЗИЛ-131 БОРТОВИЙ-С                              L2986243\n" +
            "БАЗ А079.32                           Y7FAS7931D0011386\n" +
            "БАЗ А079.04                     Y7FA0790450001215\n" +
            "ATAMAN D-093S2                Y7BD093S2HB000274\n" +
            "ГАЗ-66                               ХТН006614L0620303\n" +
            "KIA UP CARNIVAL                    KNEUP751256746420\n" +
            "УАЗ-3962                                                            №37410070215990       \n" +
            "МАЗ-8926 причіп бортовий-Е                   №2195\n" +
            "NISSAN X-TRAIL 2.2TDI   JN1TENT30U0229805    \n" +
            "ЗІЛ-4505                                                 XTP450500L3067793\n" +
            "ЗІЛ-4505 Самоскид-С      XTP450500L3067793\n" +
            "УАЗ-469                                                    283724\n" +
            "ГАЗ-2705ШД  меддопомоги       Х9627050080600782\n" +
            "АС-G 32214 ШМДА-2 меддопомога-В   Y8XG24VH0E0006008\n" +
            "ГАЗ-330232 212 Бортовий малотонажний      33023060061705\n" +
            "IVECO DAILY 65C15V/IA        ZCFC65A0035396846\n" +
            "Jeep Grand Cherokee      1J8HDE8MX7Y530105          \n" +
            "IVECO 35S фургон малотонажний-В  ZCFC3562105389182\n" +
            "FIAT SCUDO загальний легковий      ZFA138A0002953140\n" +
            "Opel Campo S                                         HAATFSJ9HX7100516\n" +
            "ЗИЛ-131 ФУРГОН-С                              436741/3200\n" +
            "КАМАЗ-55102                                                   5320072217\n" +
            "Volkswagen Transporter     WV1ZZZ70ZWH069175\n" +
            "Mercedes-benz sprinter Автобус     WDB9036611R709283\n" +
            "Mersedes-benz ML207 CDI    WDC1631132X722899\n" +
            "TOYOTA HILUX   JTFDS696900027209\n" +
            "MERCEFES-BENZ SPRINTER 410 WDB9044121P844962\n" +
            "КамАЗ-55102 Самоскид-С   5320241417\n" +
            "ЧАРЗ А 092 02 БОГДАН АВТОБУС-D Y7BA092027B001735\n" +
            "ЕТАЛОН А-081.11Ш Автобус-D  Y6PAS8111DP000294\n" +
            "Volkswagen transporter classic  WV1ZZZ7JZ6X024215\n" +
            "ГАЗ-2705  Y6F27050040007182\n" +
            "Volkswagen Transporter WV1ZZZ7HZ4H015436\n" +
            "Volkswagen Transporter  WV2ZZZ70ZYH142080\n" +
            "Volkswagen transporter  WV1ZZZ70Z1H032451\n" +
            "ГКБ-8527 Причіп-самоскид-Е  б/н\n" +
            "УрАЛ-43202   №028203\n" +
            "Kia Sorento  KNEJC521535133756\n" +
            "Citroen Berlingo   VF7GJ9HWC93355926\n" +
            "Kia Sorento   KNEJC521545295163\n" +
            "DAF XF 95.430   XLRTE47XS4E652913\n" +
            "SCHMITZ SCS 24L-1362EB WSM00000003312790\n" +
            "BMW 320D   WBAAP71000PN43182\n" +
            "KRONE SDP 27 причіп  WKESDP27011387662\n" +
            "KIA SORENTO  KNEJC521555384545\n" +
            "RENAULT MAGNUM 480  сідловий тягач-Е VF617GKA000021157\n" +
            "ГАЗ-330232  330230Y0007245\n" +
            "MITSUBISHI L200 вантажнопасажирський-В  MMBJNKB40CDZ00890\n" +
            "Причеп-платформа SCHMITZ S01  WSM00000003032791\n" +
            "RENAULT DUSTER загальний легковий  VF1HSRCFN53484095\n" +
            "RENAULT MIDLUM 220   VF644ACA000005594\n" +
            "МАЗ-500 бортовий-С  26223\n" +
            "УАЗ-3909 вантажопасажирський-В  ХТТ37410220006756\n" +
            "УАЗ-3962 АХШД меддопомога-В  ХТТ37410250437368\n" +
            "Mercedes-benz sprinter меддопомога-В  WDB9066331S649688\n" +
            "ГАЗ-6611    ХТН006611N0707728\n" +
            "Камаз-5320 вантажн.спец. Самоскид  №  0353721\n" +
            "VOLKSWAGEN TRANSPORTER T5пас.-В   WV2ZZZ7HZ7H118429\n" +
            "KIA SORENTO   KNEJC521845313454\n" +
            "УАЗ-452 ЛЄК   309479\n" +
            "HYUNDAI H100  KMFFD17APVU339913\n" +
            "УАЗ-3962  27410050463257\n" +
            "АЦ ГАЗ-3307 Б   1594932\n" +
            "ЗИЛ-131 Автомайстерня-С  896143\n" +
            "FIAT NUOVO DOBLO  ZFA26300006F38320\n" +
            "УАЗ-3303   №   039381\n" +
            "RENAULT MIDLUM 180   VF642AEA000016033\n" +
            "УАЗ-2206  37410030217248\n" +
            "FIAT DUCATO    ZFA25000001897241\n" +
            "ГАЗ-32213 414СПГ  Х9632213070584207\n" +
            "СЗАП 8551   X1W85510A80002878\n" +
            "КамАЗ-55102  6053200243758\n" +
            "МАЗ-5335 бортовий-С  20331\n" +
            "Причіп ГКБ-819   117552\n" +
            "БАЗ А079.03 автобус-D  Y7FA0790350001293\n" +
            "КамАЗ-5320       ХТС532000М0378752\n" +
            "Ford transit    WF0VXXTTFV4D87446\n" +
            "OPEL VIVARO    W0LF7ABA52V621996\n" +
            "MERCEDES-BENZ 508D    30940210380591\n" +
            "FIAT DUCATO     ZFA25000001519549\n" +
            "БОГДАН А22412    Y6LA22412KL100205\n" +
            "RENAULT MASTER T 35 2.8 DTI  VF1FDCCL522660323\n" +
            "УАЗ-3962   10000128\n" +
            "VOLKSWAGEN LT 46 FURGON    WV1ZZZ2DZ1X003774\n" +
            "NISSAN T30 X-TRAIL JN1TENT30U0138027\n" +
            "УАЗ-2206 37410070105558\n" +
            "MITSUBISHI L200 ANIMAL D/C 4WD  MMBJNKB407D157398\n" +
            "NISSAN X-TRAIL  JN1TENT30U0137131\n" +
            "Volkswagen transporter  WV2ZZZ70ZRH066823\n" +
            "ЗИЛ-131 Кунг 527793\n" +
            "ГАЗ-66    140910\n" +
            "УАЗ-3962   ХТТ220606Х0042686\n" +
            "УАЗ-3962  ХТТ37410030465524\n" +
            "АС G32214ШДН   27050080391763\n" +
            "УАЗ-3962  37410050216436\n" +
            "Камаз-5320  ХТС532000N1023872\n" +
            "ГАЗ-3302   X9633023062090338\n" +
            "MITSUBISHI L200  MBBJNK7404D037661\n";

    public final static String sum = "143629.47\n" +
            "155086.40\n" +
            "3451.50\n" +
            "284361.00\n" +
            "10000.00\n" +
            "312500.00\n" +
            "1754640.00\n" +
            "522000.00\n" +
            "10200.00\n" +
            "147000.00\n" +
            "77546.00\n" +
            "89600.00\n" +
            "13424.04\n" +
            "157800.00\n" +
            "72620.01\n" +
            "53544.00\n" +
            "173000.00\n" +
            "6830.00\n" +
            "37856.00\n" +
            "67590.00\n" +
            "30186.67\n" +
            "416140.00\n" +
            "285123.00\n" +
            "171875.00\n" +
            "614250.00\n" +
            "117500.00\n" +
            "40833.37\n" +
            "1405000.00\n" +
            "243690.00\n" +
            "175000.00\n" +
            "104400.00\n" +
            "235800.00\n" +
            "477173.33\n" +
            "150000.00\n" +
            "162348.01\n" +
            "73000.00\n" +
            "148088.90\n" +
            "54861.10\n" +
            "113834.38\n" +
            "36388.17\n" +
            "312500.00\n" +
            "149000.00\n" +
            "923837.00\n" +
            "25226.00\n" +
            "140564.00\n" +
            "27496.00\n" +
            "28346.00\n" +
            "151998.00\n" +
            "59768.00\n" +
            "39957.00\n" +
            "19345.00\n" +
            "29219.00\n" +
            "42957.00\n" +
            "28341.00\n" +
            "67851.00\n" +
            "165205.00\n" +
            "274794.00\n" +
            "126432.00\n" +
            "178500.00\n" +
            "37956.00\n" +
            "146728.00\n" +
            "68675.00\n" +
            "124517.00\n" +
            "69212.00\n" +
            "87465.00\n" +
            "68587.00\n" +
            "10000.00\n" +
            "178198.00\n" +
            "933333.33\n" +
            "95274.00\n" +
            "180000.00\n" +
            "53327.00\n" +
            "43897.00\n" +
            "73444.00\n" +
            "29898.00\n" +
            "150000.00\n" +
            "45260.00\n" +
            "49624.04\n" +
            "53501.33\n" +
            "495000.00\n" +
            "779537.62\n" +
            "98325.00\n" +
            "107000.00\n" +
            "208235.29\n" +
            "600000.00\n" +
            "73000.00\n" +
            "40834.00\n" +
            "113566.67\n" +
            "338500.00\n" +
            "634502.33\n" +
            "56227.33\n" +
            "83583.36\n" +
            "41200.00\n" +
            "164559.45\n" +
            "95161.00\n" +
            "265500.00\n" +
            "80000.00\n" +
            "205200.00\n" +
            "80000.00\n" +
            "110000.00\n" +
            "47972.00\n" +
            "98500.00\n" +
            "1997.00\n" +
            "20000.00\n" +
            "110000.00\n" +
            "20700.00\n" +
            "33727.00\n" +
            "85000.00\n" +
            "100000.00\n" +
            "102000.00\n" +
            "19000.00\n" +
            "320000.00\n" +
            "14426.45\n" +
            "154509.00\n" +
            "18000.00\n" +
            "40000.00\n" +
            "150000.00\n" +
            "63191.00\n" +
            "85000.00\n" +
            "1415700.00\n" +
            "88314.00\n" +
            "32624.00\n" +
            "93115.00\n" +
            "21175.00\n" +
            "75300.00\n" +
            "263126.00\n" +
            "135987.00\n" +
            "54532.00\n" +
            "38134.00\n" +
            "29382.00\n" +
            "44127.00\n" +
            "68675.00\n" +
            "125180.00\n" +
            "45427.00\n" +
            "134362.00\n" +
            "249356.00\n" +
            "195444.00\n";
}
